cf_billing/InformationRegisters/энргДлинаЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДлинаЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлинаЛС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргДлинаЛицевогоСчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает длину ЛС.
//
// Параметры:
//  Организация	-	СправочникСсылка.Организации.
//  Дата		-	Дата.
// 
// Возвращаемое значение:
//   Число.
//
Функция ПолучитьДлинуЛС(Знач Организация,Дата = Неопределено) Экспорт
	
	Период 			= ТекущаяДата();
	Если НЕ Дата = Неопределено Тогда
		Период 		= Дата;
	КонецЕсли;
	
	ДлинаЛС			= 14;
	Запрос			= Новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация); 
	Запрос.УстановитьПараметр("Период",Период);
	ЗАпрос.Текст = 
	"ВЫБРАТЬ
	|	ДлинаЛицевогоСчетаСрезПоследних.ДлинаЛС КАК ДлинаЛС
	|ИЗ
	|	РегистрСведений.энргДлинаЛицевогоСчета.СрезПоследних(&Период, Организация = &Организация) КАК ДлинаЛицевогоСчетаСрезПоследних";
	Результат 	= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ДлинаЛС;
	КонецЕсли;
	
	Выборка		= Результат.Выбрать();
	Выборка.Следующий();	
	ДлинаЛС 	= Выборка.ДлинаЛС;	
	Возврат ДлинаЛС;
КонецФункции

#КонецОбласти

#КонецЕсли
